
use master 
create database storedb
use storedb
---------Дропнуть---------
drop database storedb
------------1------------
-----------ЕД ИЗМЕРЕНИЯ-------------
create table Unit
(
UnitID int not null identity primary key,
UnitName varchar(5) not null
)
----------ДОСТУП-----------------
create table Access
(
AccessID int not null identity primary key,
AccessName varchar(10) not null
)
----------ФИРМЫ-----------
--exec sp_rename 'Firms.CustPhoneNumber', 'FirmPhoneNumber', 'COLUMN'
 
create table Firms
(
FirmID int not null identity primary key,
FirmName varchar(300) not null, 
UNP varchar(200) not null,
FirmLegalAddress varchar(300) not null, 
FirmAccountNumber varchar(200) not null,
FirmBankDetails varchar(300) not null,
FirmDiscountAmount float not null,
FirmPhoneNumber varchar(30) null
)
/*------------НЕ АКТУАЛЬНО--------------
----------КЛИЕНТЫ----------- CTRL + K, CTRL + U (снять комменты)
--create table Customer
--(
--CustomerID int not null identity primary key,
--CustLastName varchar(20) not null, 
--CustFirstName varchar(20) not null, 
--CustPatronymic varchar(20) not null, 
--Sex varchar(2) not null ,
--CustDateOfBirth  Date not null, 
--CustAddress varchar(200) not null, 
--CustPhoneNumber varchar(20) not null, 
--CustDiscountAmount tinyint not null
)*/
--------------------------------------
----------ПОЛЬЗОВАТЕЛИ-----------
create table Users
(
UsersID int not null identity primary key,
AccessID int foreign key references Access(AccessID),
[Login] varchar(50) not null,
[Password] varchar(50) not null,
);
--------------РАБОТНИК--------------
create table Employee 
(EmployeeID int not null identity primary key, 
UsersID int null foreign key references Users(UsersID),
EmpLastName varchar(20) not null, 
EmpFirstName varchar(20) not null, 
EmpPatronymic varchar(20) not null, 
Sex varchar(2) not null ,
EmpDateOfBirth Date not null, 
EmpAddress varchar(200) not null,
EmpPhoneNumber varchar(20) not null,
Position varchar(20) not null,
Experience tinyint not null,
--constrain CheckTeacher check (Sex = 'М' OR Sex= 'Ж') 
);

----------КАТЕГОРИИ ТОВАРА-------
create table Category
(
CategoryID  int not null identity primary key,
NameCategory varchar(20) not null,
)
----------СКЛАД-----------
create table Storage
(
StorageID  int not null identity primary key,
CategoryID int null foreign key references Category(CategoryID),
UnitID int null foreign key references Unit(UnitID),
[Name] varchar(100) not null,
[Count] tinyint not null,
[Description] varchar(350) not null,
Price float not null,
)

----------ПОКУПКИ-----------
create table Store
(
StoreID int not null identity primary key,
EmployeeID int null foreign key references Employee(EmployeeID),
FirmID int null foreign key references Firms(FirmID),
StorageID int null foreign key references Storage(StorageID),
[Count] tinyint not null,
TotalPrice float not null,
CurrentDiscountAmount float not null,
PurchaseDay Date not null,
Paid bit not null,
)
-------------------------ПРОЦЕДУРЫ
--SYSDATETIME()
--------------ДОБАВЛЕНИЕ ПОКУПКИ
--drop proc InputStore
go
create procedure InputStore 
@EmployeeID int,
@FirmID int,
@StorageID int,
@Count int,
@PurchaseDay Date
AS
begin
declare @Price float
declare @TotalPrice float
declare @CurrentDiscountAmount float 
set @CurrentDiscountAmount = (select FirmDiscountAmount from Firms where FirmID=@FirmID)
set @Price = (select Price from Storage where StorageID=@StorageID)
set @TotalPrice = ((@Price*@Count)-((@Price*@Count)*@CurrentDiscountAmount/100))

INSERT INTO Store(EmployeeID, FirmID, StorageID, [Count], TotalPrice, PurchaseDay, CurrentDiscountAmount,Paid)
                    VALUES (@EmployeeID, @FirmID, @StorageID, @Count, @TotalPrice, @PurchaseDay, @CurrentDiscountAmount,0)					
end
go
--exec InputStore @EmployeeID=3, @FirmID=3, @StorageID=3, @Count=3, @PurchaseDay='13.01.2019'
-------------------------------------------ДОБАВЛЕНИЕ КЛИЕНТА
--drop proc InsertFirm
go
create procedure InsertFirm 
@FirmName varchar(200), 
@UNP varchar(200), 
@FirmAccountNumber varchar(200), 
@FirmBankDetails varchar(200) ,
@FirmLegalAddress varchar(200),
@FirmPhoneNumber varchar(50)
AS
begin
INSERT INTO Firms(FirmName,UNP, FirmAccountNumber, FirmBankDetails, FirmLegalAddress, FirmPhoneNumber, FirmDiscountAmount)
        VALUES (@FirmName, @UNP, @FirmAccountNumber, @FirmBankDetails, @FirmLegalAddress, @FirmPhoneNumber, 0)					
end
go
--exec InsertFirm @StorageID=3, @Count=3
-------------------------------------------ДОБАВЛЕНИЕ НАИМЕНОВАНИЯ ТОВАРА
--drop proc InsertStoragesName
go
create procedure InsertStoragesName
@CategoryID int, 
@UnitID int, 
@Name varchar(100), 
@Description varchar(350),
@Price float
AS
begin
INSERT INTO Storage(CategoryID, UnitID, [Name], [Count], [Description],Price)
        VALUES (@CategoryID,@UnitID,@Name,0,@Description,@Price)					
end
go
--exec InsertStoragesName @CategoryID, @UnitID, @Name, @Description, @Price
-------------------------------------------ОТГРУЗКА ТОВАРА (изменить)
--drop proc Shipment
go
create procedure Shipment 
@ID int,
@Date Date
AS
begin
update Store 
set Paid=1
where FirmId=@ID and Store.PurchaseDay=@Date
end
go
--exec Shipment @ID=2
--update Store 
--set Paid=0
----------------- ------------------------
-------------------------------------------ОТГРУЗКА ТОВАРА (изменить)
--drop proc AddGoods
go
create procedure AddGoods 
@ID int,
@Count int
AS
begin
update Storage 
set [Count]=[Count]+@Count
where StorageID=@ID
end
go
----------------- ------------------------
insert Access(AccessName) 
values
('High'),
('Middle');
----------------------------------------
insert Users([Login], [Password],AccessID) 
values
('Admin',   '1',1),
('A1',      '1',1),
('A2',      '1',1),
('A3',      '1',1),
('A4',      '1',1),
('A5',      '1',1),
('A6',      '1',1),
('A7',      '1',1),
('A8',      '1',1),
('A9',      '1',1),
('A10',     '1',1),
('A11',     '1',1),
('A12',     '1',1),
('A13',     '1',1),
('A14',     '1',1),
('A15',     '1',1),
('A16',     '1',1),
('A17',     '1',1),
('A18',     '1',1),
('A19',     '1',1),
('A20',     '1',1),
('A21',     '1',1),
('A22',     '1',1),
('A23',     '1',1),
('A24',     '1',1),
('A25',     '1',1),
('T1',      '1',2),
('T2',      '1',2),
('T3',      '1',2),
('T4',      '1',2),
('T5',      '1',2),
('T6',      '1',2),
('T7',      '1',2),
('T8',      '1',2),
('T9',      '1',2),
('T10',     '1',2),
('T11',     '1',2),
('T12',     '1',2),
('T13',     '1',2),
('T14',     '1',2),
('T15',     '1',2),
('T16',     '1',1),
('T17',     '1',2),
('T18',     '1',2),
('T19',     '1',2),
('T20',     '1',2),
('T21',     '1',2),
('T22',     '1',2),
('T23',     '1',2),
('T24',     '1',2),
('T25',     '1',2);

--------------------------------------------------
insert Employee(UsersID,EmpLastName, EmpFirstName, EmpPatronymic, Sex, EmpDateOfBirth, EmpAddress, EmpPhoneNumber, Position, Experience) 
values 
('1','Тетерин','Панкрат','Станиславович',   'М',	'1981-08-27','г.Минск ул Слободская д58 кв 1', '152-33-32', 'Администратор',3),
('2','Лазарев','Виталий',  'Федосеевич',  'М',		'1982-10-17' ,'г.Минск ул Слободская д58 кв 2', '152-33-32', 'Администратор',2),
('3','Панов','Эрик', 'Максимович',  'М',			'1983-02-27','г.Минск ул Слободская д58 кв 3', '152-33-32', 'Администратор',1),
('4','Лапин','Май',   'Артёмович', 'М', 			'1984-01-17' ,'г.Минск ул Слободская д58 кв 4', '152-33-32', 'Администратор',2),
('5','Овчинников','Гордей',   'Данилович', 'М', 	'1985-03-17' ,'г.Минск ул Слободская д58 кв 5', '152-33-32', 'Администратор',3),
('6','Марков','Харитон', 'Германнович',   'М', 		'1986-04-17' ,'г.Минск ул Слободская д58 кв 6', '152-33-32', 'Администратор',4),
('7','Константинов','Артур',  'Платонович',  'М',	'1987-05-17' ,'г.Минск ул Слободская д58 кв 7', '152-33-32', 'Администратор',1),
('8','Исаев','Арнольд', 'Дмитрьевич',   'М', 		'1988-06-17' ,'г.Минск ул Слободская д58 кв 8', '152-33-32', 'Администратор',2),
('9','Журавлёв','Карл',  'Дмитрьевич',  'М', 		'1989-07-17' ,'г.Минск ул Слободская д58 кв 9', '152-33-32', 'Администратор',4),
('10','Кулагин','Андрей',  'Донатович',  'М', 		'1980-08-18' ,'г.Минск ул Слободская д58 кв 13', '152-33-32', 'Администратор',3),
('11','Григорьев','Устин',  'Яковлевич',  'М', 		'1992-09-19' ,'г.Минск ул Слободская д58 кв 23', '152-33-32', 'Администратор',3),
('12','Якушев','Овидий',   'Игнатьевич', 'М', 		'1992-10-20' ,'г.Минск ул Слободская д58 кв 33', '152-33-32', 'Администратор',1),
('13','Кириллов','Никитий','Анатольевич',    'М',	'1992-11-21' ,'г.Минск ул Слободская д58 кв 43', '152-33-32', 'Администратор',2),
('14','Рогов','Артем','Анатольевич','М', 			'1992-12-22' ,'г.Минск ул Слободская д58 кв 53', '152-33-32', 'Администратор',4),
('15','Красильников','Вадим','Витальевич','М', 		'1992-01-23' ,'г.Минск ул Слободская д58 кв 63', '152-33-32', 'Администратор',3),
/*('16','Тетерин','Панкрат','Станиславович',   'М', 	'1992-04-27','г.Минск ул Слободская д58 кв 73', '152-33-32', 'Администратор',2),
('17','Лазарев','Виталий',  'Федосеевич',  'М', 	'1992-01-17' ,'г.Минск ул Слободская д58 кв 83', '152-33-32', 'Администратор',3),
('18','Панов','Эрик', 'Максимович',  'М', 			'1992-02-27','г.Минск ул Слободская д58 кв 93', '152-33-32', 'Администратор',2),
('19','Лапин','Май',   'Артёмович', 'М', 			'1992-01-17' ,'г.Минск ул Слободская д58 кв 103', '152-33-32', 'Администратор',3),
('20','Овчинников','Гордей',   'Данилович', 'М',	'1992-03-17' ,'г.Минск ул Слободская д58 кв 133', '152-33-32', 'Администратор',3),
('21','Марков','Харитон', 'Германнович',   'М',		'1992-04-17' ,'г.Минск ул Слободская д58 кв 332', '152-33-32', 'Администратор',3),
('22','Константинов','Артур',  'Платонович',  'М',	'1992-05-17' ,'г.Минск ул Слободская д58 кв 333', '152-33-32', 'Администратор',5),
('23','Исаев','Арнольд', 'Дмитрьевич',   'М',		'1992-06-17' ,'г.Минск ул Слободская д58 кв 334', '152-33-32', 'Администратор',3),
('24','Журавлёв','Карл',  'Дмитрьевич',  'М',		'1992-07-17' ,'г.Минск ул Слободская д58 кв 335', '152-33-32', 'Администратор',2),
('25','Кулагин','Андрей',  'Донатович',  'М',		'1992-02-18' ,'г.Минск ул Слободская д58 кв 336', '152-33-32', 'Администратор',3),
('26','Григорьев','Устин',  'Яковлевич',  'М',		'1992-02-19' ,'г.Минск ул Слободская д58 кв 337', '152-33-32', 'Администратор',3),
('27','Якушев','Овидий',   'Игнатьевич', 'М',		'1992-02-20' ,'г.Минск ул Слободская д58 кв 338', '152-33-32', 'Администратор',2),
('28','Кириллов','Никитий','Анатольевич',    'М',	'1992-02-21' ,'г.Минск ул Слободская д58 кв 339', '152-33-32', 'Администратор',3),
('29','Басотов','Артем','Анатольевич','М',			'1992-02-22' ,'г.Минск ул Слободская д58 кв 323', '152-33-32', 'Администратор',1),
('30','Красильников','Вадим','Витальевич','М',		'1992-01-23' ,'г.Минск ул Слободская д58 кв 313', '152-33-32', 'Администратор',3),
('31','Тетерин','Панкрат','Станиславович',   'М',	'1982-08-27','г.Минск ул Слободская д58 кв 333', '152-33-32', 'Администратор',4),
('32','Лазарев','Виталий',  'Федосеевич',  'М',		'1982-10-17' ,'г.Минск ул Слободская д58 кв 343', '152-33-32', 'Администратор',3),
('33','Панов','Эрик', 'Максимович',  'М',			'1982-02-27','г.Минск ул Слободская д58 кв 353', '152-33-32', 'Администратор',5),
('34','Лапин','Май',   'Артёмович', 'М',			'1992-01-17' ,'г.Минск ул Слободская д58 кв 363', '152-33-32', 'Администратор',2),
('35','Овчинников','Гордей',   'Данилович', 'М',	'1992-03-17' ,'г.Минск ул Слободская д58 кв 373', '152-33-32', 'Администратор',3),
('36','Марков','Харитон', 'Германнович',   'М',		'1992-04-17' ,'г.Минск ул Слободская д58 кв 383', '152-33-32', 'Администратор',3),
('37','Константинов','Артур',  'Платонович',  'М',	'1992-05-17' ,'г.Минск ул Слободская д58 кв 393', '152-33-32', 'Администратор',2),
('38','Исаев','Арнольд', 'Дмитрьевич',   'М',		'1992-06-17' ,'г.Минск ул Слободская д58 кв 413', '152-33-32', 'Администратор',3),
('39','Журавлёв','Карл',  'Дмитрьевич',  'М',		'1992-07-17' ,'г.Минск ул Слободская д58 кв 523', '152-33-32', 'Администратор',1),
('40','Кулагин','Андрей',  'Донатович',  'М',		'1992-01-18' ,'г.Минск ул Слободская д58 кв 423', '152-33-32', 'Администратор',3),
('41','Григорьев','Устин',  'Яковлевич',  'М',		'1992-01-19' ,'г.Минск ул Слободская д58 кв 143', '152-33-32', 'Администратор',4),
('42','Якушев','Овидий',   'Игнатьевич', 'М',		'1992-01-20' ,'г.Минск ул Слободская д58 кв 433', '152-33-32', 'Администратор',3),
('43','Кириллов','Никитий','Анатольевич',    'М',	'1992-01-21' ,'г.Минск ул Слободская д58 кв 233', '152-33-32', 'Администратор',3),
('44','Клавишев','Артем','Анатольевич','М',			'1992-01-22' ,'г.Минск ул Слободская д58 кв 433', '152-33-32', 'Администратор',2),
('45','Красильников','Вадим','Витальевич','М',		'1992-01-23' ,'г.Минск ул Слободская д58 кв 243', '152-33-32', 'Администратор',3),
('46','Тетерин','Панкрат','Станиславович',   'М',	'1992-08-27','г.Минск ул Слободская д58 кв 533', '152-33-32', 'Администратор',1),
('47','Лазарев','Виталий',  'Федосеевич',  'М',		'1992-10-17' ,'г.Минск ул Слободская д58 кв 543', '152-33-32', 'Администратор',3),
('48','Панов','Эрик', 'Максимович',  'М',			'1992-02-27','г.Минск ул Слободская д58 кв 555', '152-33-32', 'Администратор',4),
('49','Лапин','Май',   'Артёмович', 'М',			'1992-01-17' ,'г.Минск ул Слободская д58 кв 543', '152-33-32', 'Администратор',5),
('50','Овчинников','Гордей',   'Данилович', 'М',	'1992-03-17' ,'г.Минск ул Слободская д58 кв 303', '152-33-32', 'Администратор',2);
*/
insert Firms(FirmName,UNP, FirmAccountNumber, FirmBankDetails, FirmLegalAddress, FirmDiscountAmount) 
values 
('Государственное учреждение образования "повышения квалификации"', '190583856', 'BY40BPSB30121642290179330000', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 704 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 540, к. 4',0)	,
('Министерства природных ресурсов и охраны окружающей среды Республики Беларусь', '190583857', 'BY40BPSB30121642290179331111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 550, к. 5',0),
('Абсолют-Сервис',			'190583858', 'BY40BPSB30121642290179331112', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY0X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 50, к. 5',0),
('АвтоСибирь',				'190583859', 'BY40BPSB30121642290179331113', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY1X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 51, к. 5',0),
('АТМАШ',					'190583857', 'BY40BPSB30121642290179331114', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 52, к. 5',0),
('Байкальская нерпа',		'190583847', 'BY40BPSB30121642290179331115', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY3X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 53, к. 5',0),
('БетонСтрой',				'190583837', 'BY40BPSB30121642290179331116', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY4X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 54, к. 5',0),
('Веритас',					'190583827', 'BY40BPSB30121642290179331117', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY5X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 55, к. 5',0),
('Волжский круиз',			'190583817', 'BY40BPSB30121642290179331118', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY6X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 56, к. 5',0),
('Восточный край',			'190583807', 'BY40BPSB30121642290179331119', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY7X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 57, к. 5',0),
('Геллион',					'190583897', 'BY40BPSB30121642290179331110', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY8X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 58, к. 5',0),
('Гидросим',				'190583887', 'BY40BPSB30121642290179331121', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY9X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 59, к. 5',0),
('Гросконсалт',				'190583877', 'BY40BPSB30121642290179331131', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 60, к. 5',0),
('Деловые связи',			'190583867', 'BY40BPSB30121642290179331141', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 61, к. 5',0),
('ДИНГО',					'190583757', 'BY40BPSB30121642290179331151', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 62, к. 5',0),
('ДрамМаш',					'190583657', 'BY40BPSB30121642290179331161', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 63, к. 5',0),
('Евросалон',				'190583557', 'BY40BPSB30121642290179331171', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 64, к. 5',0),
('Едим вкусно',				'190583457', 'BY40BPSB30121642290179331181', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 65, к. 5',0),
('Запасти от завода',		'190582857', 'BY40BPSB30121642290179331191', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 66, к. 5',0),
('Западные Авиалинии',		'190513857', 'BY40BPSB30121642290179331101', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 67, к. 5',0),
('Индивидуальный размер',	'130583857', 'BY40BPSB30121642290179331211', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 68, к. 5',0),
('Источник',				'190483857', 'BY40BPSB30121642290179331311', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 69, к. 5',0),
('Карьера+',				'190283857', 'BY40BPSB30121642290179331411', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 70, к. 5',0),
('Кратер',					'190582857', 'BY40BPSB30121642290179331511', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 71, к. 5',0),
('Лесные жители',			'290583857', 'BY40BPSB30121642290179331611', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 72, к. 5',0),
('Лидер-Инвест',			'180583857', 'BY40BPSB30121642290179331711', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 73, к. 5',0),
('МикроСтрой',				'170583857', 'BY40BPSB30121642290179331811', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 74, к. 5',0),
('Моторы на экспорт',		'160583857', 'BY40BPSB30121642290179331911', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 75, к. 5',0),
('Негабаритный груз',		'150583857', 'BY40BPSB30121642290179331011', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 76, к. 5',0),
('Норд-Ист',				'140583857', 'BY40BPSB30121642290179332111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 77, к. 5',0),
('Ориенталь',				'130583857', 'BY40BPSB30121642290179333111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 78, к. 5',0),
('Осто',					'120583857', 'BY40BPSB30121642290179334111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 79, к. 5',0),
('Парусник',				'110583857', 'BY40BPSB30121642290179335111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 80, к. 5',0),
('Пчела и мед',				'100583857', 'BY40BPSB30121642290179336111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 90, к. 5',0),
('РЕАЛ-Софа',				'191583857', 'BY40BPSB30121642290179337111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 81, к. 5',0),
('Райские линии',			'192583857', 'BY40BPSB30121642290179338111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 82, к. 5',0),
('СанСет',					'193583857', 'BY40BPSB30121642290179339111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 83, к. 5',0),
('Стрела Амура',			'194583857', 'BY40BPSB30121642290179330111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 84, к. 5',0),
('Три плюс один',			'195583857', 'BY40BPSB30121642290179341111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 85, к. 5',0),
('Турне', 					'196583857', 'BY40BPSB30121642290179351111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 86, к. 5',0),
('Уфимконсалт', 			'197583857', 'BY40BPSB30121642290179361111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 87, к. 5',0),
('Урал-Ресурс', 			'198583857', 'BY40BPSB30121642290179371111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 88, к. 5',0),
('Формула красоты', 		'199583857', 'BY40BPSB30121642290179381111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 89, к. 5',0),
('Фулл-Инвест', 			'190483857', 'BY40BPSB30121642290179391111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 91, к. 5',0),
('Хороший вкус', 			'190383857', 'BY40BPSB30121642290179301111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 92, к. 5',0),
('Хэви Металл',				'190283857', 'BY40BPSB30121642290179311111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 93, к. 5',0),
('Центр Автомобильного Обслуживания', '190113857', 'BY40BPSB30121242290179331111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 94, к. 5',0),
('Цитрус', 					'190522857', 'BY40BPSB30121642290179131111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 95, к. 5',0),
('Чай и булочки', 			'192383857', 'BY40BPSB30121642290179231111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 96, к. 5',0),
('Черный бриллиант', 		'192483857', 'BY40BPSB30121642290179331111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 97, к. 5',0),
('Шинная мастерская на Баумана', '192553857', 'BY40BPSB30121642220179331111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 98, к. 5',0),
('Штандарт', 				'190523457', 'BY40BPSB30121642290179431111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 99, к. 5',0),
('Элитный Персонал', 		'190543857', 'BY40BPSB30121642290179531111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 150, к. 5',0),
('ЭкоСервис', 				'123583857', 'BY40BPSB30121642290179631111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 250, к. 5',0),
('Ярмарка звука', 			'195343857', 'BY40BPSB30121642290179731111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 350, к. 5',0),
('Янтарь и золото', 		'193453857', 'BY40BPSB30121642290179831111', 'ЦБУ № 704 ОАО "БПС-Сбербанк", BIC: BPSBBY2X ЦБУ № 705 ОАО "БПС-Сбербанк"', 'г. Минск, 1-ый пер. Менделеева, д. 510, к. 5',0);
-----------------------
insert Unit (UnitName)
values
('л'),
('мм'),
('см'),
('м'),
('шт'), --5
('г'),
('кг'),
('уп');
-------------------
insert Category (NameCategory)
values 
('Отделочные материалы'),
('Общестроительные'),
('Кровельные материалы'),
('Фасадные материалы'),
('Электрика'),
('Метизы и крепеж'),
('Печные материалы'),
('Сад и огород');
-----------------------------------
insert Storage (CategoryID, UnitID, [Name], [Count], [Description], Price)
values
(1, 5,'Гипсокартон и комплектующие',100,'Гипсокартон стеновой (12.5 мм) стандартный Knauf 60 x 150 см',4.20),
(1, 5,'Гипсокартон и комплектующие',100,'Нарезанный гипсокартон стеновой (12.5 мм) стандартный 60 x 120 см',3.09),
(1, 5,'Гипсокартон и комплектующие',100,'Гипсокартон стеновой (12.5 мм) стандартный Белгипс 120 x 250 см',9.49),
(1, 5,'Гипсокартон и комплектующие',100,'Гипсокартон стеновой (12.5 мм) влагостойкий Knauf 60 x 150 см',4.90),
(1, 5,'Гипсокартон и комплектующие',100,'Гипсокартон стеновой (12.5 мм) стандартный Белгипс 120 x 300 см',11.14),
(1, 5,'Смеси строительные',100,'Цемент (портландцемент) М500 Д20, 25 кг',5.49),
(1, 5,'Смеси строительные',100,'Цемент (портландцемент) М500 Д0, 25 кг',6.50),
(1, 5,'Смеси строительные',100,'Шпатлевка на полимерном связующем Weber Vetonit LR+, 20 кг',15.20),
(1, 5,'Смеси строительные',100,'Шпатлевка гипсовая Sniezka Acryl Putz ST10 (старт + финиш), 20 кг',15.98),
(1, 5,'Смеси строительные',100,'Шпатлевка гипсовая Knauf Fugen, 10 кг',7.60),
(1, 5,'Краски и эмали',100,'Краска акриловая Sniezka Ultra Biel белая, 1 л',4.12),
(1, 5,'Краски и эмали',100,'Краска акриловая Sniezka Ultra Biel белая, 3 л',11.33),
(1, 5,'Краски и эмали',100,'Краска акриловая Sniezka Ultra Biel белая, 5 л',17.30),
(1, 5,'Краски и эмали',100,'Краска акриловая Sniezka Ultra Biel белая, 10 л',29.32),
(1, 5,'Краски и эмали',100,'Краска акриловая Снежка Ультра Бель (РБ) белая, 5 л',16.85),
(1, 5,'Грунты и грунтовки',100,'Грунтовка желтая концентрат Ceresit CT17 Profigrunt, 2 л',7.39),
(1, 5,'Грунты и грунтовки',100,'Грунтовка желтая концентрат Ceresit CT17 Profigrunt, 5 л',17.68),
(1, 5,'Грунты и грунтовки',100,'Грунтовка желтая концентрат Ceresit CT17 Profigrunt, 10 л',28.80),
(1, 5,'Грунты и грунтовки',100,'Грунтовка бесцветная концентрат Ceresit CT17 Supergrunt, 2 л',7.75),
(1, 5,'Грунты и грунтовки',100,'Грунтовка бесцветная концентрат Ceresit CT17 Supergrunt, 5 л',18.38),
(1, 5,'Сетки, стеклохолст',100,'Сетка сварная ВР-1 (3.0 мм, 100 x 100 мм) 1 x 2 м',3.95),
(1, 5,'Сетки, стеклохолст',100,'Стеклохолст малярный "паутинка" Welton-эконом, 50 м2',25.79),
(1, 5,'Сетки, стеклохолст',100,'Стеклохолст малярный "паутинка" Nortex Deco, 50 м2',24.80),
(1, 5,'Сетки, стеклохолст',100,'Стеклохолст малярный "паутинка" Nortex Ultra, 50 м2',27.96),
(1, 5,'Сетки, стеклохолст',100,'Сетка стеклотканевая штукатурная ССАП-160, 10 м2',12.87),
(1, 5,'Уголки и маяки',100,'Уголок перфорированный алюминиевый, 2.5 м',0.98),
(1, 5,'Уголки и маяки',100,'Уголок перфорированный алюминиевый, 3 м',1.19),
(1, 5,'Уголки и маяки',100,'Уголок перфорированный стальной усиленный, 2.5 м',1.12),
(1, 5,'Уголки и маяки',100,'Уголок перфорированный стальной усиленный, 3 м',1.52),
(1, 5,'Уголки и маяки',100,'Уголок алюминиевый со стеклотканевой сеткой, 2.5 м',1.87),
(1, 5,'Средства для дерева',100,'Пропитка для дерева (антисептик) Goldbastik BB 20, 10 л (до 40 м.кв.), РБ',18.88),
(1, 5,'Средства для дерева',100,'Пропитка для дерева (антисептик) Goldbastik BB 20, 5 л (до 20 м.кв.), РБ',10.94),
(1, 5,'Средства для дерева',100,'Антисептик "Биоконтакт" Goldbastik BB26, усиленная защита древесины, 5 л',9.91),
(1, 5,'Средства для дерева',100,'Антисептик "Биоконтакт" Goldbastik BB26, усиленная защита древесины, 10 л',18.03),
(1, 5,'Средства для дерева',100,'Пропитка для дерева (антисептик) Vidaron концентрат 1:9 коричневая, 5 кг (80 м.кв.), РП',69.00),
(1, 5,'Клеи, герметики, пена',100,'Очиститель пены Эксперт, 500 мл',5.38),
(1, 5,'Клеи, герметики, пена',100,'Очиститель застывшей монтажной пены PENOSIL Cured Foam Remover 340 мл',9.65),
(1, 5,'Клеи, герметики, пена',100,'Очиститель для монтажной пены Penosil Foam Cleaner, 460 мл',9.65),
(1, 5,'Клеи, герметики, пена',100,'Клей для стеклообоев готовый Bostik 70, 5 л',24.67),
(1, 5,'Клеи, герметики, пена',100,'Клей для стеклообоев готовый Bostik 70, 15 л',53.31),
(2, 5,'Блоки и кирпичи',100,'Блок перегородочный (D500) 625 x 250 x 100 мм МКСИ',1.69),
(2, 5,'Блоки и кирпичи',100,'Блок перегородочный (D500) 625 x 250 x 120 мм МКСИ',2.09),
(2, 5,'Блоки и кирпичи',100,'Блок перегородочный (D500) 625 x 250 x 125 мм ЗАБУДОВА',2.38),
(2, 5,'Блоки и кирпичи',100,'Блок перегородочный (D500) 625 x 250 x 200 мм ЗАБУДОВА',3.60),
(2, 5,'Блоки и кирпичи',100,'Цемент (портландцемент) М500 Д20, 25 кг',5.49),
(3, 5,'Шифер',100,'Шифер хризотилцементный 8-волновой серый (5.2 мм) 113 x 175 см, РБ',7.20),
(3, 5,'Шифер',100,'Шифер хризотилцементный 8-волновой серый (5.8 мм) 113 x 175 см, РБ',8.20),
(3, 5,'Шифер',100,'Шифер хризотилцементный 8-волновой серый (5.2 мм) 113 x 175 см, РФ',7.80),
(3, 5,'Шифер',100,'Шифер хризотилцементный 8-волновой серый (5.8 мм) 113 x 175 см, РФ',8.40),
(3, 5,'Шифер',100,'Шифер хризотилцементный плоский серый (6 мм) 175 x 110 см, РБ',9.95),
(4, 5,'Отделка фасада',100,'Штукатурка ''шуба'' Тайфун Мастер №22С под окраску, 25 кг',12.90),
(4, 5,'Отделка фасада',100,'Штукатурка ''структурная'' Ceresit CT36 под окраску, 25 кг',12.89),
(4, 5,'Отделка фасада',100,'Краска фасадная акриловая Condor Fassandenfarde-Object, 15 кг',59.95),
(4, 5,'Отделка фасада',100,'Штукатурка ''короед'' (2.0 мм) Тайфун Мастер №23.2 под окраску, 25 кг',10.73),
(4, 5,'Отделка фасада',100,'Штукатурка ''короед'' (3.0 мм) Тайфун Мастер №23.3 под окраску, 25 кг',10.39),
(5, 5,'Кабели и провода',100,'Кабель ВВГ п-нг 2-х жильный медный, сечение 1,5мм (0,66 кВ)',1.06),
(5, 5,'Кабели и провода',100,'Кабель ВВГ п-нг 2-х жильный медный, сечение 2,5мм (0,66 кВ)',1.36),
(5, 5,'Кабели и провода',100,'Кабель ВВГ п-нг (А) 3-х жильный медный, сечение 2,5 мм (0,66 кВ)',1.88),
(5, 5,'Кабели и провода',100,'Провод ПВС 3х0,75мм медный (0,66 кВ) Автопровод, Щучин',0.65),
(5, 5,'Кабели и провода',100,'Провод ПВС-Т 2х0,75 белый, Автопровод-Щучин',0.59),
(6, 8,'Саморезы и шурупы',100,'Саморез 3.5*25 мм для монтажа ГКЛ к металлу, фосфат (100 шт в зип-локе) STARFIX (SMZ2-96507-100)',3.15),
(6, 8,'Саморезы и шурупы',100,'Саморез 3.5*35 мм для монтажа ГКЛ к металлу, фосфат (50 шт в зип-локе) STARFIX (SMZ2-96517-50)',2.38),
(6, 8,'Саморезы и шурупы',100,'Саморез 3.5*35 мм для монтажа ГКЛ к металлу, фосфат (1000 шт в карт. уп.) STARFIX (SMC3-96517-1000)',16.07),
(6, 8,'Саморезы и шурупы',100,'Саморез 3.5*45 мм для монтажа ГКЛ к металлу, фосфат (500 шт в карт. уп.) STARFIX (SMC3-96527-500)',9.72),
(6, 8,'Саморезы и шурупы',100,'Саморез 3.5*55 мм для монтажа ГКЛ к металлу, фосфат (500 шт в карт. уп.) STARFIX (SMC3-96537-500)',11.78),
(7, 5,'Кирпич для печи',100,'Кирпич керамический рядовой полнотелый одинарный КРО-200 КЕРАМИН',0.55),
(7, 5,'Кирпич для печи',100,'Кирпич рядовой полнотелый одинарный КРО М200 (Витебск, Цех №1)',0.60),
(7, 5,'Кирпич для печи',100,'Кирпич рядовой полнотелый одинарный КРО М200 с закругленным углом (Витебск, Цех №1)',0.95),
(7, 5,'Составы для печи',100,'Кладочно-штукатурная жаростойкая смесь Тайфун Мастер ПЕЧНИК, 25 кг',17.52),
(7, 5,'Составы для печи',100,'Порошок глиняный тарированный, 15кг',7.50),
(8, 5,'Садовый инвентарь',100,'Тачка садовая ECO WB6203-1 (65л, 150кг, 1 пневмоколесо 3.25-8) (WB6203-1)',53.84),
(8, 5,'Садовый инвентарь',100,'Тачка садовая DGM GT-1081 (80л, 150кг, 1 пневмоколесо 3.25-8) (GT-1081)',53.47),
(8, 5,'Садовый инвентарь',100,'Тачка строительно-садовая ТССР-1П (100л, 120 кг, 1 пневмоколесо 400*90мм, вес 15 кг) (КОМ) (ТССР-1П)',85.25),
(8, 5,'Садовый инвентарь',100,'Спанбонд №17 белый (2.1x10м) (4810751573830)',5.41),
(8, 5,'Садовый инвентарь',100,'Спанбонд №30 белый (рулон 1,6*300м, 960м.кв.) (1108568252004)',272.89);

insert Store (EmployeeID,FirmID,StorageID,[Count],TotalPrice,PurchaseDay, CurrentDiscountAmount,Paid)
values
(2,1,3,1,9.49,'12-1-2019',0,0),
(3,2,3,1,9.49,'12-1-2019',0,1),
(4,1,3,1,9.49,'12-1-2019',0,0),
(2,2,3,1,9.49,'12-1-2019',0,1),
(3,1,3,1,9.49,'12-1-2019',0,0);

---------------------------ТРИГЕРЫ
---------Триггер на подсчет TotalPrice (Store)
---------Триггер на проверку при покупки, что бы на складе было достаточно материалов
go
create trigger insertEmployee
on Employee
after insert
as
begin
declare @LastName varchar(20)
declare @FirstName varchar(20)
declare @Patronymic varchar(20)
set @LastName = (select inserted.EmpLastName from inserted)
set @FirstName = (select inserted.EmpFirstName from inserted)
set @Patronymic = (select inserted.EmpPatronymic from inserted)

if((select count(EmployeeID) from Employee 
where Employee.EmpLastName=@LastName and Employee.EmpFirstName=@FirstName and Employee.EmpPatronymic=@Patronymic )>1) 
rollback TRANSACTION
end
go

insert Employee(UsersID,EmpLastName, EmpFirstName, EmpPatronymic, Sex, EmpDateOfBirth, EmpAddress, EmpPhoneNumber, Position, Experience) 
values 
('1','Бабочкин','Панкрат','Станиславович',   'М',	'1981-08-27','г.Минск ул Слободская д58 кв 1', '152-33-32', 'Администратор',3)


----------Тригер на изменение скидки покупатели после добавления покупки
go
create trigger insertStore
on Store
after insert
as
begin
---уменьшение товара на складе--------------------------------
declare @StorageID tinyint
declare @Count tinyint
declare @AvRating float
set @StorageID = (select inserted.StorageID from  inserted )
set @Count = (select inserted.[Count] from  inserted )
update Storage
set 
[Count]=[Count]-@Count
where StorageID=@StorageID
---------------------------------------------------------------
declare @TotalTotalPrice float
declare @TotalPrice float
declare @FirmID int
set @FirmID = (select inserted.FirmID from  inserted )
set @TotalTotalPrice = 0
set @TotalPrice = 0
declare cursorStore cursor  
--set @cursorStore = CURSOR scroll
for select TotalPrice from store where FirmID = @FirmID

open cursorStore
fetch next from cursorStore into @TotalPrice
while @@FETCH_STATUS=0
begin 
set @TotalTotalPrice = @TotalTotalPrice+@TotalPrice
fetch next from cursorStore into @TotalPrice
end
close cursorStore

if (@TotalTotalPrice >10000) 
begin 
update Firms
set FirmDiscountAmount = 1
where FirmID = @FirmID 
end 
if (@TotalTotalPrice >50000) 
begin 
update Firms
set FirmDiscountAmount = 2
where FirmID = @FirmID 
end 
if (@TotalTotalPrice >100000) 
begin 
update Firms
set FirmDiscountAmount = 3
where FirmID = @FirmID 
end 
--set @AvRating = (select Avg(Rating) from Logs where (Logs.StudentID = @ID))
--update Student set AverRating =  @AvRating where Student.StudentID=@ID
end
go

--drop trigger insertStore

--------------------------------------------------------НИЖЕ ЗАПРОСЫ------------------------------------------------
--select Storage.[Description], UnitName, Store.[Count], Store.TotalPrice, Storage.Price from Store
--join Storage on (Store.StorageID= Storage.StorageID)
--join Unit on (Storage.UnitID = Unit.UnitID)
--where Store.PurchaseDay='' and
--Store.FirmID=''
select FirmName, UNP, FirmLegalAddress, FirmAccountNumber,FirmBankDetails, FirmPhoneNumber from Firms where FirmID=2

select EmpFirstName, EmpLastName--, sum(Store.TotalPrice)  
                from Employee 
              --join Firms on(Store.FirmID = Firms.FirmID) 
                join Store on (Store.EmployeeID=Employee.EmployeeID)
              --join Storage on(Store.StorageID= Storage.StorageID) 
				group by EmpFirstName, 2

select sum(TotalPrice) from Store where EmployeeID = (select EmployeeID from Employee where EmpFirstName like '%4')

select Employee.EmpFirstName, Employee.EmpLastName, sum(TotalPrice) as "Продано на сумму"
from Store 
join Employee on (Store.EmployeeID=Employee.EmployeeID)
group by Employee.EmpFirstName, Employee.EmpLastName

		
		select Storage.[Description], UnitName, Store.[Count], Store.TotalPrice, Storage.Price, Store.FirmID, Store.PurchaseDay 
                from Store 
                join Storage on(Store.StorageID = Storage.StorageID) 
                join Unit on(Storage.UnitID = Unit.UnitID) 
				where Store.PurchaseDay = '2019-05-16' and 
                Store.FirmID = 1 and
                Paid = 0
            
			select Storage.[Description], UnitName, Store.[Count], Store.TotalPrice, Storage.Price, Store.CurrentDiscountAmount 
			from Store join Storage on(Store.StorageID = Storage.StorageID) join Unit on(Storage.UnitID = Unit.UnitID) 
			where /*Store.PurchaseDay = '28.05.2019' and */Store.FirmID = 3 and Paid = 0

			select Storage.[Description], UnitName, Store.[Count], Store.TotalPrice, Storage.Price, Store.CurrentDiscountAmount 
			from Store join Storage on(Store.StorageID = Storage.StorageID) join Unit on(Storage.UnitID = Unit.UnitID) 
			where Store.PurchaseDay = '26.05.2019 0:00:00' and Store.FirmID = 3 and Paid = 0